module.exports.config = {
name: "autosent",
version: "10.02",
hasPermssion: 0,
credits: "SHANKAR SUMAN",
description: "Set Karne Ke Bad Automatically Msg Send Karega",
commandCategory: "group messenger",
 usePrefix: false, 
usages: "[]",
cooldowns: 3
};
const nam = [{
timer: "12:00:00 AM",
message: ['──── •💖🌿• ────\n𝐈𝐭𝐬 10:30:P𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\nआपका दिमाग कितना भी तेज क्यों ना हो, नसीब के बिना आप जीत नहीं सकते।🙂🙂\n\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n──── •🌿💖• ────'] ,
},
{
timer: "1:00:00 AM",
message: ['──── •☘️•❤️ ────\n𝐈𝐭𝐬 11:30 PM\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\n कभी भी किसी की मजबूरी पर मत हंसो क्योंकि कोई भी मजबूरी को ख़रीद कर नहीं लाता ।🙂\n\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n──── •🌸💛• ────'] ,
},
{
timer: '2:00:00 AM',
message: ['──── •💙✨• ──── \n𝐈𝐭𝐬 12:30 𝐀𝐌 \n𝐓𝐲𝐩𝐢𝐧𝐠...\n\nहमारी जिंदगी का इकलौता मकसद है खुश रहना।\n\n ہے🧡\nयाद रखना.. बीरबल चाहे कितना भी अकलमंद था लेकिन बादशाह नहीं बन सका।☘️ \n\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n ──── •🧡💫• ────'] ,
},
{
timer: '3:00:00 AM',
message: ['──── •💫💜• ──── \n𝐈𝐭𝐬 1:30 𝐀𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\n✦ आप ना तो खुद को गले लगा सकते हो और ना ही अपने कंधे पर सर रख सकते हो।☹️☹️✦\n\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n ──── •💜🌿• ────'] ,
},
{
timer: '4:00:00 AM',
message: ['──── •💙✨• ──── \n𝐈𝐭𝐬 2:30 𝐀𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\nइससे कोई फर्क नहीं पड़ता कि आपके पास नैनो है या मर्सिडीज-  सड़क वही रहेगी। \n\nघड़ी आप चाहे कितनी भी महंगी पहन लो समय वही रहेगा।✨💫💔🙂\n\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥⸙❱≼≽\n\n ──── •💫🧡• ────']
},
{
timer: '5:00:00 AM',
message: ['──── •🌸🧡• ──── \n𝐈𝐭𝐬 3:30 𝐀𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\nआपके पास फोन नोकिया का हो या फिर एप्पल का-  कॉल करने वाले लोग वही रहेंगे।👉🙄🙄Good morning all🥀\n\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n ──── •🌿💛• ────']
},
{
timer: '6:00:00 AM',
message: ['──── •❤️•💫 ──── \n𝐈𝐭𝐬 4:30 𝐀𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\nअगर आपके जीवन में दुख हैं तो उन्हें कोसो मत क्योंकि जब भी ये आते हैं तो कुछ नया सिखा कर जाते हैं।💖💖Good morning 🥀\n\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n──── •☘️•💖 ────']
},
{
timer: '7:00:00 AM',
message: ['──── •🌸💫• ──── \n𝐈𝐭𝐬 5:30 𝐀𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\nगुस्सा चाहे दो पल का हो🙂💔\nप्यार भरा रिश्ता तोड़ ही देता है☘️Good morning guys🙂\n\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n ──── •💔🌿• ────']
},
{
timer: '8:00:00 AM',
message: ['──── •💜🍃• ──── \n𝐈𝐭𝐬 6:30 𝐀𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\n अगर रास्ता मुश्किल लगे तो एक बात याद रखना, मंज़िल बहुत खूबसूरत होगी।☘️\nGood morning have a good day💞🙂\n\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n──── •⭐✨• ────']
},
{
timer: '9:00:00 AM',
message: ['──── •💫🌿• ────\n𝐈𝐭𝐬 7:30 𝐀𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\nकहते हैं कि समय नूर को बेनूर बना देता है, इसीलिए वक्त की कदर करो क्योंकि यह कोयले को भी कोहिनूर बना देता है। \n\n❣️जब आप बेहतर जानते हो तभी आप और बेहतर करते हो💋💋 Morning all 😍।\n\n ≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n──── •💛⭐• ────']
},
{
timer: '10:00:00 AM',
message: ['──── •☘️•💛 ────\n𝐈𝐭𝐬 8:30 𝐀𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\nकभी उसको नज़र अंदाज़ ना करो जो आपकी बहुत परवाह करता हो नहीं तो किसी दिन आपको एहसास होगा कि 🙄पत्थर जमा करते करते आपने हीरा गवा दिया... ❤️Good morning 💋 💋 🙂\n\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n──── •💜⭐• ────']
},
{
timer: '11:00:00 AM',
message: ['──── •✨🌸• ────\n𝐈𝐭𝐬 9:30 𝐀𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\n हे प्रभु....ना मैंने तुझको देखा ना कभी हम मिले फ़िर ऐसा क्या रिश्ता है दर्द कोई भी हो याद तेरी ही आती है..!!  शुभ प्रभात 💖💖🙂\n\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n──── •🍃💙• ────']
},
{
timer: '12:00:00 PM',
message: ['──── •💔💫• ────\n𝐈𝐭𝐬 10:30 𝐀𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\जरूरी नहीं कि हर ठोकर आप को गिराने के लिए ही हो कुछ ठोकरें आपको सिखाने के लिए भी होती हैं। 💔💫\n गरीब का कोई दोस्त नहीं होता. ये कड़वा है लेकिन सच है। 🙄🙄😴good morning break fast kar lo\n\n ≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n──── •☘️•💛 ────']
},
{
timer: '01:00:00 PM',
message: ['──── •💜⭐• ────\n𝐈𝐭𝐬 11:30 𝐀𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...n\Those you love will also go away one day, but you do not know when.💔\n\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n──── •⭐🌿• ────']
},
{
timer: '2:00:00 PM',
message: ['──── •✨☘️• ────\n𝐈𝐭𝐬 12:30 𝐏𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\n If you have saved money today, then later on, money will save you.👉🙂😍✨\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n──── •💙✨• ────']
},
{
timer: '3:00:00 PM',
message: ['──── •⭐💙• ────\n𝐈𝐭𝐬 1:30 𝐏𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\n जब तक बेटा बाप नहीं बन जाता, तब तक पिता का हर निर्णय गलत ही लगता है। \n💖💖💖जितने अच्छे आपके रिश्ते होंगे, उतना ही अच्छा आपका जीवन होगा। !!🙂\n \n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n──── •💛💫• ────']
},
{
timer: '4:00:00 PM',
message: ['──── •🌸🧡• ────\n𝐈𝐭𝐬 2:30 𝐏𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\n*अगर आप गरीबी में पैदा हुए हो तो इसमें आपकी कोई गलती नहीं, लेकिन आप गरीब ही मरते हो तो सारा दोष आपका है।🙄😴😴۔  💔🙂*\n\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n──── •⭐✨• ────']
},
{
timer: '5:00:00 PM',
message: ['──── •🧡💫• ────\n𝐈𝐭𝐬 3:30 𝐏𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\nअपनी सेहत का ख्याल रखो, यही वो जगह है जहाँ आपने सारी उम्र रहना है। 💖💖💖🙂\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n──── •💜🌿• ────']
},
{
timer: '6:00:00 PM',
message: ['──── •🌸🧡• ────\n𝐈𝐭𝐬 4:30 𝐏𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\nकिसी से सहानुभूति की आस मत रखो  🙂🥀\nऔर अपनी कहानी खुद लिखो।🥱🥱🥱😴\n\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n ──── •💙💫• ────']
},
{
timer: '7:00:00 PM',
message: ['──── •💖🌿• ────\n𝐈𝐭𝐬 5:30 𝐏𝐌 𝐓𝐲𝐩𝐢𝐧𝐠...\n\nकिसी से दिल लग जाने को मुहब्बत नहीं कहते 🙂 \nजिसके बिना दिल ना लगे उसे मुहब्बत कहते हैं...!!good evng💔\n\n ≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n──── •✨🌸• ────']
},
{
timer: '8:00:00 PM',
message: ['──── •💛🌸• ────\n𝐈𝐭𝐬 6:30 𝐏𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\nसच्चाई और अच्छाई के लिए चाहे पूरी दुनिया घूम लो,\n अगर आपके खुद के अंदर नहीं तो कहीं नहीं मिलेगी। 🙂\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n──── •☘️•💙 ────']
},
{
timer: '9:00:00 PM',
message: ['──── •🌸💔• ────\n𝐈𝐭𝐬 7:30 𝐏𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\nअगर आपके पास योजना और रोड मैप सब कुछ है तो मंज़िल तक पहुँचने के लिए जिस चीज़ की आपको आवश्यकता है, 👉\n वो है साहस। 💖💖☘️\n\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n──── •⭐🌿• ────']
},
{
timer: '10:00:00 PM',
message: ['──── •💖⭐• ────\n𝐈𝐭𝐬 8:30 𝐏𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\nअपने दिमाग को इस कदर ट्रेनिंग दें,👉 कि उसे हर स्तिथि में अच्छाई दिखे। 💖💖\n\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n──── •☘️•💙 ────']
},
{
timer: '11:00:00 PM',
message: ['──── •💔🌿• ────\n𝐈𝐭𝐬 9:30 𝐏𝐌\n𝐓𝐲𝐩𝐢𝐧𝐠...\n\nआप हर किसी के लिए सब कुछ नहीं हो सकते \n इस प्रयास में ज़िन्दगी खराब भी मत कीजिए।🙂💞💞\n≼≽Ω ๏๏ ︻❱𝐓𝐡𝕖 𝗦𝗛𝗔𝗡𝗞𝗔𝗥 ⸙❱≼≽\n──── •❤️🌸• ────']
}];
module.exports.onLoad = o => {
  setInterval(() => {
    const currentTime = new Date().toLocaleTimeString();
    const messageObject = nam.find(i => i.timer === currentTime);
    if (messageObject) {
      global.data.allThreadID.forEach(i => {
        setTimeout(() => {
          o.api.sendMessage(r(messageObject.message), i);
        }, 500); // add a 500ms delay between message sends
      });
    }
  }, 5000); // increase the interval to 5 seconds
};
